luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxSmu_bf.h
/** \brief  Mask for Ifx_SMU_OCS_Bits.SUS_P */
#define IFX_SMU_OCS_SUS_P_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_OCS_Bits.SUS_P */
#define IFX_SMU_OCS_SUS_P_OFF (28u)

/** \brief  Length for Ifx_SMU_OCS_Bits.SUSSTA */
#define IFX_SMU_OCS_SUSSTA_LEN (1u)

/** \brief  Mask for Ifx_SMU_OCS_Bits.SUSSTA */
#define IFX_SMU_OCS_SUSSTA_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_OCS_Bits.SUSSTA */
#define IFX_SMU_OCS_SUSSTA_OFF (29u)

/** \brief  Length for Ifx_SMU_OCS_Bits.TG_P */
#define IFX_SMU_OCS_TG_P_LEN (1u)

/** \brief  Mask for Ifx_SMU_OCS_Bits.TG_P */
#define IFX_SMU_OCS_TG_P_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_OCS_Bits.TG_P */
#define IFX_SMU_OCS_TG_P_OFF (3u)

/** \brief  Length for Ifx_SMU_OCS_Bits.TGB */
#define IFX_SMU_OCS_TGB_LEN (1u)

/** \brief  Mask for Ifx_SMU_OCS_Bits.TGB */
#define IFX_SMU_OCS_TGB_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_OCS_Bits.TGB */
#define IFX_SMU_OCS_TGB_OFF (2u)

/** \brief  Length for Ifx_SMU_OCS_Bits.TGS */
#define IFX_SMU_OCS_TGS_LEN (2u)

/** \brief  Mask for Ifx_SMU_OCS_Bits.TGS */
#define IFX_SMU_OCS_TGS_MSK (0x3u)

/** \brief  Offset for Ifx_SMU_OCS_Bits.TGS */
#define IFX_SMU_OCS_TGS_OFF (0u)

/** \brief  Length for Ifx_SMU_PCTL_Bits.HWDIR */
#define IFX_SMU_PCTL_HWDIR_LEN (1u)

/** \brief  Mask for Ifx_SMU_PCTL_Bits.HWDIR */
#define IFX_SMU_PCTL_HWDIR_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_PCTL_Bits.HWDIR */
#define IFX_SMU_PCTL_HWDIR_OFF (0u)

/** \brief  Length for Ifx_SMU_PCTL_Bits.HWEN */
#define IFX_SMU_PCTL_HWEN_LEN (1u)

/** \brief  Mask for Ifx_SMU_PCTL_Bits.HWEN */
#define IFX_SMU_PCTL_HWEN_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_PCTL_Bits.HWEN */
#define IFX_SMU_PCTL_HWEN_OFF (1u)

/** \brief  Length for Ifx_SMU_PCTL_Bits.PCFG */
#define IFX_SMU_PCTL_PCFG_LEN (16u)

/** \brief  Mask for Ifx_SMU_PCTL_Bits.PCFG */
#define IFX_SMU_PCTL_PCFG_MSK (0xffffu)

/** \brief  Offset for Ifx_SMU_PCTL_Bits.PCFG */
#define IFX_SMU_PCTL_PCFG_OFF (16u)

/** \brief  Length for Ifx_SMU_PCTL_Bits.PCS */
#define IFX_SMU_PCTL_PCS_LEN (1u)

/** \brief  Mask for Ifx_SMU_PCTL_Bits.PCS */
#define IFX_SMU_PCTL_PCS_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_PCTL_Bits.PCS */
#define IFX_SMU_PCTL_PCS_OFF (7u)

/** \brief  Length for Ifx_SMU_RMCTL_Bits.TE */
#define IFX_SMU_RMCTL_TE_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMCTL_Bits.TE */
#define IFX_SMU_RMCTL_TE_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMCTL_Bits.TE */
#define IFX_SMU_RMCTL_TE_OFF (0u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF0 */
#define IFX_SMU_RMEF_EF0_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF0 */
#define IFX_SMU_RMEF_EF0_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF0 */
#define IFX_SMU_RMEF_EF0_OFF (0u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF10 */
#define IFX_SMU_RMEF_EF10_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF10 */
#define IFX_SMU_RMEF_EF10_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF10 */
#define IFX_SMU_RMEF_EF10_OFF (10u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF11 */
#define IFX_SMU_RMEF_EF11_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF11 */
#define IFX_SMU_RMEF_EF11_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF11 */
#define IFX_SMU_RMEF_EF11_OFF (11u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF12 */
#define IFX_SMU_RMEF_EF12_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF12 */
#define IFX_SMU_RMEF_EF12_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF12 */
#define IFX_SMU_RMEF_EF12_OFF (12u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF13 */
#define IFX_SMU_RMEF_EF13_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF13 */
#define IFX_SMU_RMEF_EF13_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF13 */
#define IFX_SMU_RMEF_EF13_OFF (13u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF14 */
#define IFX_SMU_RMEF_EF14_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF14 */
#define IFX_SMU_RMEF_EF14_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF14 */
#define IFX_SMU_RMEF_EF14_OFF (14u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF15 */
#define IFX_SMU_RMEF_EF15_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF15 */
#define IFX_SMU_RMEF_EF15_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF15 */
#define IFX_SMU_RMEF_EF15_OFF (15u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF16 */
#define IFX_SMU_RMEF_EF16_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF16 */
#define IFX_SMU_RMEF_EF16_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF16 */
#define IFX_SMU_RMEF_EF16_OFF (16u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF17 */
#define IFX_SMU_RMEF_EF17_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF17 */
#define IFX_SMU_RMEF_EF17_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF17 */
#define IFX_SMU_RMEF_EF17_OFF (17u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF18 */
#define IFX_SMU_RMEF_EF18_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF18 */
#define IFX_SMU_RMEF_EF18_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF18 */
#define IFX_SMU_RMEF_EF18_OFF (18u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF19 */
#define IFX_SMU_RMEF_EF19_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF19 */
#define IFX_SMU_RMEF_EF19_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF19 */
#define IFX_SMU_RMEF_EF19_OFF (19u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF1 */
#define IFX_SMU_RMEF_EF1_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF1 */
#define IFX_SMU_RMEF_EF1_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF1 */
#define IFX_SMU_RMEF_EF1_OFF (1u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF20 */
#define IFX_SMU_RMEF_EF20_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF20 */
#define IFX_SMU_RMEF_EF20_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF20 */
#define IFX_SMU_RMEF_EF20_OFF (20u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF21 */
#define IFX_SMU_RMEF_EF21_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF21 */
#define IFX_SMU_RMEF_EF21_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF21 */
#define IFX_SMU_RMEF_EF21_OFF (21u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF22 */
#define IFX_SMU_RMEF_EF22_LEN (1u)

