luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxSmu_bf.h
/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS15 */
#define IFX_SMU_RMSTS_STS15_OFF (15u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS16 */
#define IFX_SMU_RMSTS_STS16_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS16 */
#define IFX_SMU_RMSTS_STS16_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS16 */
#define IFX_SMU_RMSTS_STS16_OFF (16u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS17 */
#define IFX_SMU_RMSTS_STS17_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS17 */
#define IFX_SMU_RMSTS_STS17_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS17 */
#define IFX_SMU_RMSTS_STS17_OFF (17u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS18 */
#define IFX_SMU_RMSTS_STS18_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS18 */
#define IFX_SMU_RMSTS_STS18_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS18 */
#define IFX_SMU_RMSTS_STS18_OFF (18u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS19 */
#define IFX_SMU_RMSTS_STS19_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS19 */
#define IFX_SMU_RMSTS_STS19_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS19 */
#define IFX_SMU_RMSTS_STS19_OFF (19u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS1 */
#define IFX_SMU_RMSTS_STS1_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS1 */
#define IFX_SMU_RMSTS_STS1_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS1 */
#define IFX_SMU_RMSTS_STS1_OFF (1u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS20 */
#define IFX_SMU_RMSTS_STS20_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS20 */
#define IFX_SMU_RMSTS_STS20_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS20 */
#define IFX_SMU_RMSTS_STS20_OFF (20u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS21 */
#define IFX_SMU_RMSTS_STS21_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS21 */
#define IFX_SMU_RMSTS_STS21_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS21 */
#define IFX_SMU_RMSTS_STS21_OFF (21u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS22 */
#define IFX_SMU_RMSTS_STS22_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS22 */
#define IFX_SMU_RMSTS_STS22_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS22 */
#define IFX_SMU_RMSTS_STS22_OFF (22u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS23 */
#define IFX_SMU_RMSTS_STS23_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS23 */
#define IFX_SMU_RMSTS_STS23_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS23 */
#define IFX_SMU_RMSTS_STS23_OFF (23u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS24 */
#define IFX_SMU_RMSTS_STS24_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS24 */
#define IFX_SMU_RMSTS_STS24_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS24 */
#define IFX_SMU_RMSTS_STS24_OFF (24u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS25 */
#define IFX_SMU_RMSTS_STS25_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS25 */
#define IFX_SMU_RMSTS_STS25_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS25 */
#define IFX_SMU_RMSTS_STS25_OFF (25u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS26 */
#define IFX_SMU_RMSTS_STS26_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS26 */
#define IFX_SMU_RMSTS_STS26_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS26 */
#define IFX_SMU_RMSTS_STS26_OFF (26u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS27 */
#define IFX_SMU_RMSTS_STS27_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS27 */
#define IFX_SMU_RMSTS_STS27_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS27 */
#define IFX_SMU_RMSTS_STS27_OFF (27u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS28 */
#define IFX_SMU_RMSTS_STS28_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS28 */
#define IFX_SMU_RMSTS_STS28_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS28 */
#define IFX_SMU_RMSTS_STS28_OFF (28u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS29 */
#define IFX_SMU_RMSTS_STS29_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS29 */
#define IFX_SMU_RMSTS_STS29_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS29 */
#define IFX_SMU_RMSTS_STS29_OFF (29u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS2 */
#define IFX_SMU_RMSTS_STS2_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS2 */
#define IFX_SMU_RMSTS_STS2_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS2 */
#define IFX_SMU_RMSTS_STS2_OFF (2u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS30 */
#define IFX_SMU_RMSTS_STS30_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS30 */
#define IFX_SMU_RMSTS_STS30_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS30 */
#define IFX_SMU_RMSTS_STS30_OFF (30u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS31 */
#define IFX_SMU_RMSTS_STS31_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS31 */
#define IFX_SMU_RMSTS_STS31_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS31 */
#define IFX_SMU_RMSTS_STS31_OFF (31u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS3 */
#define IFX_SMU_RMSTS_STS3_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS3 */
#define IFX_SMU_RMSTS_STS3_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS3 */
#define IFX_SMU_RMSTS_STS3_OFF (3u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS4 */
#define IFX_SMU_RMSTS_STS4_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS4 */
#define IFX_SMU_RMSTS_STS4_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS4 */
#define IFX_SMU_RMSTS_STS4_OFF (4u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS5 */
#define IFX_SMU_RMSTS_STS5_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS5 */
#define IFX_SMU_RMSTS_STS5_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS5 */
#define IFX_SMU_RMSTS_STS5_OFF (5u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS6 */
#define IFX_SMU_RMSTS_STS6_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS6 */
#define IFX_SMU_RMSTS_STS6_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS6 */
#define IFX_SMU_RMSTS_STS6_OFF (6u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS7 */
#define IFX_SMU_RMSTS_STS7_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS7 */
#define IFX_SMU_RMSTS_STS7_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS7 */
#define IFX_SMU_RMSTS_STS7_OFF (7u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS8 */
#define IFX_SMU_RMSTS_STS8_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS8 */
#define IFX_SMU_RMSTS_STS8_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS8 */
#define IFX_SMU_RMSTS_STS8_OFF (8u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS9 */
#define IFX_SMU_RMSTS_STS9_LEN (1u)

